import requests
from bs4 import BeautifulSoup
import re

url = 'https://pozdravok.com/pozdravleniya/imena/'
def about_names(smb_name):
    response = requests.get(url)
    # print(response)
    soup = BeautifulSoup(response.text, 'html')
    soup = str(soup)
    # print(soup)
    link_list = []
    start = 0
    for _ in range(236):
        start_ind = soup.find('<a href="/pozdravleniya/imena/', start + 1)
        temp_str = soup[start_ind + 9: start_ind + 42]
        end_ind = temp_str.find('">')
        temp_link = temp_str[:end_ind]
        link_list.append(temp_link)
        start = soup.find(temp_link + '">') + 12
    # print(link_list)
    name_list = ['абрам', 'аврора', 'агата', 'агния', 'адам', 'аделина', 'аида', 'айгуль', 'алан', 'алевтина',
                 'александр', 'александра', 'алексей', 'алена', 'али', 'алина', 'алиса', 'алла', 'алсу', 'альберт',
                 'альбина', 'амелия', 'амина', 'амир', 'анастасия', 'анатолий', 'ангелина', 'андрей', 'анжела', 'анна',
                 'антон', 'антонина', 'ариана', 'арина', 'аркадий', 'арсен', 'арсений', 'артем', 'артемий', 'артур',
                 'ася', 'афанасий', 'белла', 'богдан', 'борис', 'вадим', 'валентин', 'валентина', 'валерий', 'валерия',
                 'варвара', 'василий', 'василиса', 'венера', 'вениамин', 'вера', 'вероника', 'виктор', 'виктория', 'виолетта',
                 'виталий', 'влада', 'владимир', 'владислав', 'всеволод', 'вячеслав', 'галина', 'геннадий', 'георгий', 'герман',
                 'глеб', 'гордей', 'григорий', 'гульназ', 'гульнара', 'давид', 'дамир', 'дана', 'даниил', 'дарина',
                 'дарья', 'демид', 'денис', 'диана', 'дина', 'динара', 'дмитрий', 'ева', 'евгений', 'евгения',
                 'егор', 'екатерина', 'елена', 'елизавета', 'елисей', 'есения', 'ефим', 'жанна', 'захар', 'зинаида',
                 'злата', 'зоя', 'иван', 'игорь', 'илона', 'илья', 'инга', 'инесса', 'инна', 'иннокентий',
                 'иосиф', 'ирина', 'камилла', 'карина', 'каролина', 'кира', 'кирилл', 'клавдия', 'клара', 'константин',
                 'кристина', 'ксения', 'леда', 'лариса', 'лев', 'лейла', 'леонид', 'лидия', 'лилия', 'луиза',
                 'любовь', 'людмила', 'мадина', 'майя', 'макар', 'максим', 'мальвина', 'марат', 'маргарита', 'марианна',
                 'марина', 'мария', 'марк', 'марта', 'марьям', 'марьяна', 'матвей', 'мелания', 'мила', 'милана',
                 'милена', 'мирон', 'мирослав', 'мирослава', 'михаил', 'мурат', 'надежда', 'назар', 'наиль', 'наталья',
                 'нелли', 'ника', 'никита', 'николай', 'николь', 'нина', 'нонна', 'оксана', 'олег', 'олеся',
                 'оливия', 'ольга', 'остап', 'павел', 'петр', 'платон', 'полина', 'раиса', 'рамазан', 'регина',
                 'ренат', 'римма', 'роберт', 'родион', 'роза', 'роман', 'ростислав', 'руслан', 'рустам', 'савва',
                 'савелий', 'светлана', 'святослав', 'семен', 'сергей', 'снежана', 'софия', 'спартак', 'станислав', 'степан',
                 'стефания', 'таисия', 'тамара', 'тарас', 'татьяна', 'тимофей', 'тимур', 'тихон', 'ульяна', 'умар',
                 'фаина', 'фатима', 'федор', 'феликс', 'филипп', 'фома', 'шамиль', 'эвелина', 'эдуард', 'элеонора',
                 'элина', 'элла', 'эльвира', 'эльдар', 'эльза', 'эльмира', 'эмилия', 'эмиль', 'эмма', 'юлия',
                 'юрий', 'яков', 'ян', 'яна', 'ярослав', 'ярослава']

    name_link_dict = {}

    for name, link in zip(name_list, link_list):
        name_link_dict[name] = link
    if smb_name.lower() in name_list:
        # print(name_link_dict)
        response = requests.get('https://pozdravok.com' + name_link_dict[smb_name.lower()])
        # print(name_link_dict[smb_name.lower()])
        soup = BeautifulSoup(response.text, 'html')
        # soup.prettify()
        soup = str(soup)
        # print(soup)
        start_ind_text = soup.find('<p>') + 3
        end_ind_text = soup.find('</p>')
        a = soup[start_ind_text: end_ind_text]
        return re.sub(r'(\<(/?[^>]+)>)', '', a)
    return 'Такого имени я пока не знаю ¯\_(ツ)_/¯'





# print(about_names('ярослава'))