{"Овен": "Сегодня Овен и деликатность будут как никогда друг от друга далеки! День наделяет его прямолинейным желанием высказывать все, что Овен считает нужным, окружающим прямо в лицо. Его логика при этом будет проста: я знаю как лучше, мое мнение правильное. Чтобы такое поведение Овна не стало почвой для ссор, звезды гороскопа советуют ему направить свой пыл в какое-нибудь мирное русло. В делах, где окружающие не путаются у Овна под ногами, он способен сегодня совершить невозможное!\n",
  "Телец" : "Сегодня ключом к успеху в гороскопе Тельца будет решительность! Телец может отважиться на смелый шаг, единственное условие – этот шаг должен быть хорошо продуман. Так что если у Тельца в запасе есть план, для осуществления которого не хватало смелости, то сегодня самое время начать действовать. Хуже, если Телец сегодня возьмется за какое-то дело спонтанно, под влиянием мимолетных желаний или эмоций: внезапные порывы способны толкнуть его на опрометчивый поступок.",
  "Близнецы" : "Сегодня окружающие могут втянуть Близнецов в спор, бессмысленное обсуждение или конфликт. Возможно, Близнецы даже почувствуют, что кто-то питается их эмоциями, энергетически вампирит! Звезды гороскопа советуют им сегодня в некомфортной ситуации просто уйти в сторону. Лучше для вида согласиться, чем вступить в полемику и потом чувствовать себя выжатым, как лимон. Другими словами, не подставляйте вампирам шею – и вы выбьете у них почву из-под ног.",
  "Рак": "Сегодня Раку следует быть осторожным в общении, особенно с близкими людьми. Звезды гороскопа склоняют его к тому, чтобы действовать с наскока там, где нужен тонкий подход. Кроме того, Рак способен быть критичным по отношению к окружающим, высказывая им свое недовольство. Чтобы не испортить отношения с кем-то из близких, звезды советуют Раку сегодня в разговорах не касаться болезненных и деликатных тем. Решить проблему он все равно не сможет, а вот обострить ее – запросто.",
  "Лев": "Сегодня Лев может случайно обидеть кого-то, даже совершенно того не желая. Звезды склоняют его к тому, чтобы сначала говорить, а потом уже думать, к каким последствиям это приведет. Так что под влиянием эмоций Лев способен случайно разболтать чужую тайну или высказать собеседнику нелицеприятную правду прямо в лицо. Чтобы не плодить недоразумения, звезды гороскопа советуют сегодня Льву выбраться туда, где все танцуют и оглушительно гремит музыка – там ему будет не до обличительных разговоров.",
  "Дева": "Сегодня любая мелочь в глазах Девы способна принять размеры слона! Из-за этого ей будет трудно расставить приоритеты, определившись, какие дела надо делать в первую очередь, а какие можно отложить на потом. Все будет казаться ей одинаково важным. В результате же Дева сегодня способна хвататься сразу за все и… так ничего и не успеть. Чтобы день не прошел в бессмысленной гонке, звезды гороскопа советуют Деве вспомнить мудрую мысль: «Счастье человека – где-то между свободой и дисциплиной». Немного дисциплины в мыслях и делах сегодня ей не повредит.",
  "Весы": "Сегодня звезды гороскопа советуют Весам не идти окольными путями там, где можно двигаться напрямую. Прямой путь самый короткий, но как часто мы забываем об этом! Сегодня успешная стратегия Весов проста: никакой хитрости, обмана и попыток что-то скрыть. Во всех сферах жизни – и в дружбе, и в работе, и в любви – Весам помогут искренность и честность. Проблемы? Расскажите о них. Хотите чего-то достичь? Заявите об этом. Сегодня четко сформулированная цель откроет перед Весами новые возможности и новые двери.",
  "Скорпион": "Сегодня Скорпион может демонстрировать бескомпромиссность, яростно обрушиваясь на тех, кто решится ставить ему палки в колеса или рискнет открыто возразить. Впрочем, не менее яростно Скорпион способен защищать своих друзей или всех несправедливо обиженных. С одной стороны, такой категоричный настрой позволит ему сегодня разбить в пух и прах своих оппонентов, с другой же – к вечеру Скорпион может с удивлением обнаружить, что нажил себе несколько новых врагов или новых друзей.",
  "Стрелец": "Сегодня у Стрельца может появиться возможность что-то исправить. Это может касаться и бытовых вопросов, и рабочих моментов, а может и чего-то более глобального, вроде взаимоотношений с близкими людьми. Конечно, нелегко признаться себе и окружающим в том, что наделал ошибок, но, в конце концов, все люди ошибаются: одни больше, а другие всегда. Признав сегодня свою неправоту в каком-то вопросе, Стрелец не пожалеет – он сбросит со своих плеч немалый груз, а взамен ему откроются новые перспективы.",
  "Козерог": "Сегодня для Козерога настало время действовать! Можно сколько угодно строить планы, однако когда-нибудь их надо претворять в жизнь. Возможно, Козерог не мог решиться начать какой-то проект, признаться в своих чувствах, заказать путевку на море или сделать покупку, о которой мечтал. Если так, то сегодня хороший день для того, чтобы волевым решением взять быка за рога. И даже если впереди еще долгий путь, не надо бояться: любая дорога начинается с первого шага.",
  "Водолей": "Сегодня звезды гороскопа советуют Водолею приготовиться к тому, что ему придется отстаивать свои интересы. Речь может идти о судебном разбирательстве, о денежном споре или обвинениях в его адрес. Между тем, сегодня Водолею вряд ли удастся выйти победителем из спорной ситуации и доказать окружающим свою правоту. Даже если на руках у него железные аргументы, звезды советуют ему подождать. Лучше продемонстрировать свои козыри в другой день, когда у Водолея будет больше шансов на победу.",
  "Рыбы": "Сегодня Рыбам не стоит попадаться начальству на глаза – есть вероятность попасть под горячую руку! Впрочем, речь может идти и просто о людях, от которых Рыбы в чем-то зависят или которые имеют на них влияние: родителях, любимом человеке, друзьях. Звезды гороскопа говорят, что сегодня риск оказаться для кого-то «крайним» для Рыб весьма велик. Чтобы день прошел без обидных эксцессов, им необходимо поставить между собой и окружающими непробиваемый щит из обаяния и чувства юмора."}